jorgemzz/PIC-ASM-Programming/RUTINAS_TECLADO/TECLADO_MUSICAL/PIC16CXX.INC
 IFDEF __16C74
   ;----- Register Files --------------------------------------------------
PORTC                     EQU     H'0007'
PORTD                     EQU     H'0008'
PORTE                     EQU     H'0009'
PIR1                      EQU     H'000C'
PIR2                      EQU     H'000D'
TMR1L                     EQU     H'000E'
TMR1H                     EQU     H'000F'
T1CON                     EQU     H'0010'
TMR2                      EQU     H'0011'
T2CON                     EQU     H'0012'
SSPBUF                    EQU     H'0013'
SSPCON                    EQU     H'0014'
CCPR1L                    EQU     H'0015'
CCPR1H                    EQU     H'0016'
CCP1CON                   EQU     H'0017'
RCSTA                     EQU     H'0018'
TXREG                     EQU     H'0019'
RCREG                     EQU     H'001A'
CCPR2L                    EQU     H'001B'
CCPR2H                    EQU     H'001C'
CCP2CON                   EQU     H'001D'

TRISC                     EQU     H'0087'
TRISD                     EQU     H'0088'
TRISE                     EQU     H'0089'
PIE1                      EQU     H'008C'
PIE2                      EQU     H'008D'
PCON                      EQU     H'008E'
PR2                       EQU     H'0092'
SSPADD                    EQU     H'0093'
SSPSTAT                   EQU     H'0094'
TXSTA                     EQU     H'0098'
SPBRG                     EQU     H'0099'

   __MAXRAM H'0FF'
   __BADRAM H'08F'-H'091', H'095'-H'097', H'09A'-H'09E'
   #define __ADC_CONFIG_1
   #define __CONFIG_2
 ENDIF

 IFDEF __16C84
   ;----- Register Files --------------------------------------------------
EEDATA                    EQU     H'0008'
EEADR                     EQU     H'0009'
EECON1                    EQU     H'0088'
EECON2                    EQU     H'0089'

   __MAXRAM H'0AF'
   __BADRAM H'07', H'030'-H'07F', H'087'
   #define __CONFIG_0
 ENDIF

;==========================================================================
;
;       Configuration Bits
;
;==========================================================================

 IFDEF __CONFIG_0
_CP_ON                       EQU     H'3FEF'
_CP_OFF                      EQU     H'3FFF'
_PWRTE_ON                    EQU     H'3FFF'
_PWRTE_OFF                   EQU     H'3FF7'
_WDT_ON                      EQU     H'3FFF'
_WDT_OFF                     EQU     H'3FFB'
_LP_OSC                      EQU     H'3FFC'
_XT_OSC                      EQU     H'3FFD'
_HS_OSC                      EQU     H'3FFE'
_RC_OSC                      EQU     H'3FFF'

   #undefine __CONFIG_0
 ENDIF


 IFDEF __CONFIG_1
_BODEN_ON                    EQU     H'3FFF'
_BODEN_OFF                   EQU     H'3FBF'
_CP_ON                       EQU     H'004F'
_CP_OFF                      EQU     H'3FFF'
_PWRTE_OFF                   EQU     H'3FFF'
_PWRTE_ON                    EQU     H'3FF7'
_WDT_ON                      EQU     H'3FFF'
_WDT_OFF                     EQU     H'3FFB'
_LP_OSC                      EQU     H'3FFC'
_XT_OSC                      EQU     H'3FFD'
_HS_OSC                      EQU     H'3FFE'
_RC_OSC                      EQU     H'3FFF'

   #undefine __CONFIG_1
 ENDIF


 IFDEF __CONFIG_2
_CP_ALL                      EQU     H'3F8F'
_CP_75                       EQU     H'3F9F'
_CP_50                       EQU     H'3FAF'
_CP_OFF                      EQU     H'3FBF'
_PWRTE_ON                    EQU     H'3FBF'
_PWRTE_OFF                   EQU     H'3FB7'
_WDT_ON                      EQU     H'3FBF'
_WDT_OFF                     EQU     H'3FBB'
_LP_OSC                      EQU     H'3FBC'
_XT_OSC                      EQU     H'3FBD'
_HS_OSC                      EQU     H'3FBE'
_RC_OSC                      EQU     H'3FBF'

   #undefine __CONFIG_2
 ENDIF


 IFDEF __CONFIG_3
_CP_ON                       EQU     H'000F'
_CP_OFF                      EQU     H'3FFF'
_PWRTE_ON                    EQU     H'3FFF'
_PWRTE_OFF                   EQU     H'3FF7'
_WDT_ON                      EQU     H'3FFF'
_WDT_OFF                     EQU     H'3FFB'
_LP_OSC                      EQU     H'3FFC'
_XT_OSC                      EQU     H'3FFD'
_HS_OSC                      EQU     H'3FFE'
_RC_OSC                      EQU     H'3FFF'

   #undefine __CONFIG_3
 ENDIF


 IFDEF __CONFIG_4
_BODEN_ON                    EQU     H'3FFF'
_BODEN_OFF                   EQU     H'3FBF'
_CP_ALL                      EQU     H'00CF'
_CP_50                       EQU     H'15DF'
_CP_OFF                      EQU     H'3FFF'
_PWRTE_OFF                   EQU     H'3FFF'
_PWRTE_ON                    EQU     H'3FF7'
_WDT_ON                      EQU     H'3FFF'
_WDT_OFF                     EQU     H'3FFB'
_LP_OSC                      EQU     H'3FFC'
_XT_OSC                      EQU     H'3FFD'
_HS_OSC                      EQU     H'3FFE'
_RC_OSC                      EQU     H'3FFF'

   #undefine __CONFIG_4
 ENDIF


 IFDEF __CONFIG_5
_BODEN_ON                    EQU     H'3FFF'

_BODEN_OFF                   EQU     H'3FBF'
_CP_ALL                      EQU     H'00CF'
_CP_75                       EQU     H'15DF'
_CP_50                       EQU     H'2AEF'
_CP_OFF                      EQU     H'3FFF'
_PWRTE_OFF                   EQU     H'3FFF'
_PWRTE_ON                    EQU     H'3FF7'
_WDT_ON                      EQU     H'3FFF'
_WDT_OFF                     EQU     H'3FFB'
_LP_OSC                      EQU     H'3FFC'
_XT_OSC                      EQU     H'3FFD'
_HS_OSC                      EQU     H'3FFE'
_RC_OSC                      EQU     H'3FFF'

   #undefine __CONFIG_5
 ENDIF

 IFDEF __CONFIG_6
_BODEN_ON                    EQU     H'3FFF'
_BODEN_OFF                   EQU     H'3FBF'
_CP_ON                       EQU     H'00CF'
_CP_OFF                      EQU     H'3FFF'
_PWRTE_OFF                   EQU     H'3FFF'
_PWRTE_ON                    EQU     H'3FF7'
_WDT_ON                      EQU     H'3FFF'
_WDT_OFF                     EQU     H'3FFB'
_LP_OSC                      EQU     H'3FFC'
_XT_OSC                      EQU     H'3FFD'
_HS_OSC                      EQU     H'3FFE'
_RC_OSC                      EQU     H'3FFF'

   #undefine __CONFIG_6
 ENDIF

