jorgemzz/PIC-ASM-Programming/RUTINAS_TECLADO/TECLADO_MUSICAL/PIC16CXX.INC
;==========================================================================
;
;       More Bit Definitions
;
;==========================================================================

 IFDEF __ADC_CONFIG_0
   ;---- Register Files ---------------------------------------------------
ADCON0                    EQU     H'0008'
ADRES                     EQU     H'0009'

ADCON1                    EQU     H'0088'

   ;---- Finish INTCON Definition -----------------------------------------
ADIE                      EQU     H'0006'

   ;----- ADCON0 Bits -----------------------------------------------------
ADCS1                     EQU     H'0007'
ADCS0                     EQU     H'0006'
CHS1                      EQU     H'0004'
CHS0                      EQU     H'0003'
GO                        EQU     H'0002'
NOT_DONE                  EQU     H'0002'
GO_DONE                   EQU     H'0002'
ADIF                      EQU     H'0001'
ADON                      EQU     H'0000'

   ;----- ADCON1 Bits -----------------------------------------------------
PCFG1                     EQU     H'0001'
PCFG0                     EQU     H'0000'

   #undefine __ADC_CONFIG_0
 ELSE
   ;---- Finish INTCON Definition -----------------------------------------
PEIE                      EQU     H'0006'
 ENDIF


 IFDEF __ADC_CONFIG_1
   ;----- Register Files --------------------------------------------------
ADRES                     EQU     H'001E'
ADCON0                    EQU     H'001F'
ADCON1                    EQU     H'009F'

   ;----- ADCON0 Bits -----------------------------------------------------
ADCS1                     EQU     H'0007'
ADCS0                     EQU     H'0006'
CHS2                      EQU     H'0005'
CHS1                      EQU     H'0004'
CHS0                      EQU     H'0003'
GO                        EQU     H'0002'
NOT_DONE                  EQU     H'0002'
GO_DONE                   EQU     H'0002'
ADON                      EQU     H'0000'

   ;----- ADCON1 Bits -----------------------------------------------------
PCFG2                     EQU     H'0002'
PCFG1                     EQU     H'0001'
PCFG0                     EQU     H'0000'

   ;----- PIE1 and PIR1 ADC Bits ------------------------------------------
ADIE                      EQU     H'0006'
ADIF                      EQU     H'0006'

   #undefine __ADC_CONFIG_1
 ENDIF


 IFDEF CCP1CON
CCP1X                        EQU     H'0005'
CCP1Y                        EQU     H'0004'
CCP1M3                       EQU     H'0003'
CCP1M2                       EQU     H'0002'
CCP1M1                       EQU     H'0001'
CCP1M0                       EQU     H'0000'
 ENDIF


 IFDEF CCP2CON
CCP2X                        EQU     H'0005'
CCP2Y                        EQU     H'0004'
CCP2M3                       EQU     H'0003'
CCP2M2                       EQU     H'0002'
CCP2M1                       EQU     H'0001'
CCP2M0                       EQU     H'0000'
 ENDIF


 IFDEF CMCON
C2OUT                        EQU     H'0007'
C1OUT                        EQU     H'0006'
CIS                          EQU     H'0003'
CM2                          EQU     H'0002'
CM1                          EQU     H'0001'
CM0                          EQU     H'0000'

   ;----- PIE1 and PIR1 ADC Bits ------------------------------------------
CMIE                      EQU     H'0006'
CMIF                      EQU     H'0006'
 ENDIF


 IFDEF EECON1
EEIF                         EQU     H'0004'
WRERR                        EQU     H'0003'
WREN                         EQU     H'0002'
WR                           EQU     H'0001'
RD                           EQU     H'0000'
 ENDIF


 IFDEF PCON
NOT_POR                      EQU     H'0001'
NOT_BO                       EQU     H'0000'
 ENDIF


 IFDEF PIE1
PSPIE                        EQU     H'0007'
SSPIE                        EQU     H'0003'
CCP1IE                       EQU     H'0002'
TMR2IE                       EQU     H'0001'
TMR1IE                       EQU     H'0000'
 ENDIF


 IFDEF PIR1
PSPIF                        EQU     H'0007'
SSPIF                        EQU     H'0003'
CCP1IF                       EQU     H'0002'
TMR2IF                       EQU     H'0001'
TMR1IF                       EQU     H'0000'
 ENDIF


 IFDEF PIE2                                             ; Assumes PIE2 and PIR2
CCP2IE                       EQU     H'0000'
CCP2IF                       EQU     H'0000'
 ENDIF


 IFDEF RCSTA
SPEN                         EQU     H'0007'
RC9                          EQU     H'0006'
NOT_RC8                      EQU     H'0006'
RC8_9                        EQU     H'0006'
SREN                         EQU     H'0005'
CREN                         EQU     H'0004'
FERR                         EQU     H'0002'
OERR                         EQU     H'0001'
RCD8                         EQU     H'0000'

   ;----- PIE1 and PIR1 RC Bits ------------------------------------------
RCIE                      EQU     H'0005'
RBFL                      EQU     H'0005'
 ENDIF


 IFDEF SSPCON
WCOL                         EQU     H'0007'
SSPOV                        EQU     H'0006'
SSPEN                        EQU     H'0005'
CKP                          EQU     H'0004'
SSPM3                        EQU     H'0003'
SSPM2                        EQU     H'0002'
SSPM1                        EQU     H'0001'
SSPM0                        EQU     H'0000'
 ENDIF


 IFDEF SSPSTAT
D                            EQU     H'0005'
I2C_DATA                     EQU     H'0005'
NOT_A                        EQU     H'0005'
NOT_ADDRESS                  EQU     H'0005'
D_A                          EQU     H'0005'
DATA_ADDRESS                 EQU     H'0005'
P                            EQU     H'0004'
I2C_STOP                     EQU     H'0004'
S                            EQU     H'0003'
I2C_START                    EQU     H'0003'
R                            EQU     H'0002'
I2C_READ                     EQU     H'0002'
NOT_W                        EQU     H'0002'
NOT_WRITE                    EQU     H'0002'
R_W                          EQU     H'0002'
READ_WRITE                   EQU     H'0002'
UA                           EQU     H'0001'
BF                           EQU     H'0000'
 ENDIF


 IFDEF T1CON
T1CKPS1                      EQU     H'0005'
T1CKPS0                      EQU     H'0004'
T1OSCEN                      EQU     H'0003'
T1INSYNC                     EQU     H'0002'
TMR1CS                       EQU     H'0001'
TMR1ON                       EQU     H'0000'
 ENDIF


 IFDEF T2CON
TOUTPS3                      EQU     H'0006'
TOUTPS2                      EQU     H'0005'
TOUTPS1                      EQU     H'0004'
TOUTPS0                      EQU     H'0003'
TMR2ON                       EQU     H'0002'
T2CKPS1                      EQU     H'0001'
T2CKPS0                      EQU     H'0000'
 ENDIF


 IFDEF TRISE
IBF                          EQU     H'0007'
OBF                          EQU     H'0006'
IBOV                         EQU     H'0005'
PSPMODE                      EQU     H'0004'
TRISE2                       EQU     H'0002'
TRISE1                       EQU     H'0001'
TRISE0                       EQU     H'0000'
 ENDIF


 IFDEF TXSTA
CSRC                         EQU     H'0007'
TX9                          EQU     H'0006'
NOT_TX8                      EQU     H'0006'
TX8_9                        EQU     H'0006'
TXEN                         EQU     H'0005'
SYNC                         EQU     H'0004'
BRGH                         EQU     H'0002'
TRMT                         EQU     H'0001'
TXD8                         EQU     H'0000'

   ;----- PIE1 and PIR1 TX Bits ------------------------------------------

TXIE                      EQU     H'0004'
TXIF                      EQU     H'0004'
 ENDIF


 IFDEF VRCON
VREN                         EQU     H'0007'
VROE                         EQU     H'0006'
VRR                          EQU     H'0005'
VR3                          EQU     H'0003'
VR2                          EQU     H'0002'
VR1                          EQU     H'0001'
VR0                          EQU     H'0000'
 ENDIF

